#+startup: latexpreview
* Python virtual environment
#+begin_src bash :dir ./ :results drawer :exports none
  pwd
  virtualenv py3_venv
#+end_src

#+RESULTS:
:results:
/home/lsg/dev/Python
Using base prefix '/usr'
New python executable in /home/lsg/dev/Python/py3_venv/bin/python3
Also creating executable in /home/lsg/dev/Python/py3_venv/bin/python
Installing setuptools, pip, wheel...
done.
:end:

#+begin_src elisp :results drawer :exports none
  (pyvenv-activate "home/lsg/dev/Python/py3_venv")
#+end_src

#+RESULTS:
:results:
nil
:end:

#+begin_src bash :results drawer :exports none
  pip install numpy matplotlib
#+end_src

#+RESULTS:
:results:
Collecting numpy
  Using cached https://files.pythonhosted.org/packages/1f/c7/198496417c9c2f6226616cff7dedf2115a4f4d0276613bab842ec8ac1e23/numpy-1.16.4-cp27-cp27mu-manylinux1_x86_64.whl
Collecting matplotlib
  Using cached https://files.pythonhosted.org/packages/32/6b/0368cfa5e1d1ae169ab7dc78addda3fd5e6262e48d7373a9114bac7caff7/matplotlib-2.2.4-cp27-cp27mu-manylinux1_x86_64.whl
Collecting cycler>=0.10 (from matplotlib)
  Using cached https://files.pythonhosted.org/packages/f7/d2/e07d3ebb2bd7af696440ce7e754c59dd546ffe1bbe732c8ab68b9c834e61/cycler-0.10.0-py2.py3-none-any.whl
Collecting backports.functools-lru-cache (from matplotlib)
  Using cached https://files.pythonhosted.org/packages/03/8e/2424c0e65c4a066e28f539364deee49b6451f8fcd4f718fefa50cc3dcf48/backports.functools_lru_cache-1.5-py2.py3-none-any.whl
Collecting subprocess32 (from matplotlib)
  Downloading https://files.pythonhosted.org/packages/32/c8/564be4d12629b912ea431f1a50eb8b3b9d00f1a0b1ceff17f266be190007/subprocess32-3.5.4.tar.gz (97kB)
Collecting kiwisolver>=1.0.1 (from matplotlib)
  Downloading https://files.pythonhosted.org/packages/3d/78/cb9248b2289ec31e301137cedbe4ca503a74ca87f88cdbfd2f8be52323bf/kiwisolver-1.1.0-cp27-cp27mu-manylinux1_x86_64.whl (93kB)
Collecting pytz (from matplotlib)
  Downloading https://files.pythonhosted.org/packages/3d/73/fe30c2daaaa0713420d0382b16fbb761409f532c56bdcc514bf7b6262bb6/pytz-2019.1-py2.py3-none-any.whl (510kB)
Collecting six>=1.10 (from matplotlib)
  Using cached https://files.pythonhosted.org/packages/73/fb/00a976f728d0d1fecfe898238ce23f502a721c0ac0ecfedb80e0d88c64e9/six-1.12.0-py2.py3-none-any.whl
Collecting python-dateutil>=2.1 (from matplotlib)
  Using cached https://files.pythonhosted.org/packages/41/17/c62faccbfbd163c7f57f3844689e3a78bae1f403648a6afb1d0866d87fbb/python_dateutil-2.8.0-py2.py3-none-any.whl
Collecting pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 (from matplotlib)
  Downloading https://files.pythonhosted.org/packages/dd/d9/3ec19e966301a6e25769976999bd7bbe552016f0d32b577dc9d63d2e0c49/pyparsing-2.4.0-py2.py3-none-any.whl (62kB)
Collecting setuptools (from kiwisolver>=1.0.1->matplotlib)
  Downloading https://files.pythonhosted.org/packages/ec/51/f45cea425fd5cb0b0380f5b0f048ebc1da5b417e48d304838c02d6288a1e/setuptools-41.0.1-py2.py3-none-any.whl (575kB)
Building wheels for collected packages: subprocess32
  Running setup.py bdist_wheel for subprocess32: started
  Running setup.py bdist_wheel for subprocess32: finished with status 'done'
  Stored in directory: /home/lsg/.cache/pip/wheels/68/39/1a/5e402bdfdf004af1786c8b853fd92f8c4a04f22aad179654d1
Successfully built subprocess32
Installing collected packages: numpy, six, cycler, backports.functools-lru-cache, subprocess32, setuptools, kiwisolver, pytz, python-dateutil, pyparsing, matplotlib
Successfully installed backports.functools-lru-cache-1.5 cycler-0.10.0 kiwisolver-1.1.0 matplotlib-2.2.4 numpy-1.16.4 pyparsing-2.4.0 python-dateutil-2.8.0 pytz-2019.1 setuptools-41.0.1 six-1.12.0 subprocess32-3.5.4
:end:

** Ex 1.4
Take $\mathbb{R}^2$ and choose a random line in the plane as the target function.
#+begin_src python :session lfd :results output
  def rand_target_line_2d():
      fit = 1
      while fit:
          a = np.random.randn()
          b = np.random.randn()
          if a>0 and b>0.7:
              fit = 1
          elif a<0 and b<0.3:
              fit = 1
          elif a<0 and a+b>0.7:
              fit = 1
          elif a>0 and a+b<0.3:
              fit = 1
          else:
              fit = 0
      return a,b
#+end_src

#+RESULTS:

#+begin_src python :session lfd :results output
  def split_region_2d(a,b,x1,x2):
      if a>0:
          y = np.sign(a*x1+b-x2)
      else:
          y = np.sign(x2-(a*x1+b))
      return y
#+end_src

#+RESULTS:

Choose the inputs $\mathbf{x}_n$ of the data set as random points in the plane, and evaluate the target function on each $\mathbf{x}_n$ to get the corresponding output $y_n$.
#+begin_src python :session lfd :results output
  def eval_target_func_2d(n):
      x = np.zeros((n,2))
      for i in range(n):
          x[i,0]=np.random.rand()
          x[i,1]=np.random.rand()
      y = np.zeros(n)
      (a,b) = rand_target_line_2d()
      for i in range(n):
          y[i]=split_region_2d(a,b,x[i,0],x[i,1])
      return x,y,a,b
  n = 20
  x,y,a1,a2=eval_target_func_2d(n)
#+end_src

#+RESULTS:

Try the perceptron learning algorithm on your data set and see how long it takes to converge and how well the final hypothesis $g$ matches your target $f$.
For $d$-dimensional Euclidean space with inputs $\mathbf{x}\in\mathbb{R}^d$, the input space is
\begin{equation*}
\mathcal{X}=\{1\}\times\mathbb{R}^d=\{(1,x_1,\cdots,x_d)^\top\}
\end{equation*}
The weights vector includes the bias $b$ such that the weight vector becomes
\begin{equation*}
\mathbf{w}=(b,w_1,\cdots,w_2)^\top
\end{equation*}
The hypothesis function $h$ is
\begin{equation*}
h(\mathbf{x})=\text{sign}(\mathbf{w}^\top\mathbf{x})
\end{equation*}
The perceptron learning algorithm (PLA) is
- iterate
-- calculate $h(t)$ using $h(t)=\text{sign}(\mathbf{w}(t)^\top\mathbf{x}(t))$
-- compare $y(t)$ and $h(t)$
-- pick an example that is currently misclassified by the current weight vector $\mathbf{w}(t)$
-- Update $\mathbf{w}$ by $\mathbf{w}(t+1)=\mathbf{w}(t)+y(t)\mathbf{x}(t)$.
#+begin_src python :session lfd :results output
  def pla(n,x,y,w0,b):
      x = np.insert(x,0,1,axis=1)
      w = np.insert(w0,0,b)
      converge = False
      for iteration in range(100000):
          h = np.sign(np.inner(w,x))
          if np.array_equal(y,h):
              break
          for i in range(n):
              if y[i] != h[i]:
                  w += y[i]*x[i]
                  break
      print('The interation number is {}'.format(iteration+1))
      print('The weight vector is {}'.format(w))
      return h
  w0 = np.array([0.1,0])
  h = pla(n,x,y,w0,0)
  def plot_perceptron_2d(x,h,a1,a2):
      x1 = np.linspace(0,1,50)
      x2 = a1*x1+a2
      fig = plt.figure()
      plt.plot(x1,x2)
      plt.axis((0,1,0,1))
      for i in range(n):
          if h[i]>0:
              plt.scatter(x[i,0],x[i,1],c="blue")
          else:
              plt.scatter(x[i,0],x[i,1],c="red")
      plt.show()
      return
  plot_perceptron_2d(x,h,a1,a2)
#+end_src

#+RESULTS:
: The interation number is 16
: The weight vector is [-1.          0.21959959  3.47891366]

